MoltenHydrogen/alpakka-firmware-esp32s3/main/headers/pin.h
// SPDX-License-Identifier: GPL-2.0-only
// Copyright (C) 2022, Input Labs Oy.

#pragma once

#define PIN_HOME 20
#define PIN_LED_PICO 5
#define PIN_LED_UP 13
#define PIN_LED_RIGHT 0
#define PIN_LED_DOWN 2
#define PIN_LED_LEFT 15
#define PIN_TOUCH_OUT 4
#define PIN_TOUCH_IN 16
#define PIN_ROTARY_A 5
#define PIN_ROTARY_B 17
#define PIN_SDA 33
#define PIN_SCL 32
#define PIN_SPI_CK 18
#define PIN_SPI_TX 23
#define PIN_SPI_RX 19
#define PIN_SPI_CS0 34
#define PIN_SPI_CS1 35
#define PIN_TX 27
#define PIN_TY 26
// IO EXPANSION 1.
#define PIN_SELECT_1 114
#define PIN_SELECT_2 113
#define PIN_DPAD_LEFT 104
#define PIN_DPAD_RIGHT 101
#define PIN_DPAD_UP 103
#define PIN_DPAD_DOWN 100
#define PIN_L1 102
#define PIN_L2 115
#define PIN_L3 112
#define PIN_L4 109
// IO EXPANSION 2.
#define PIN_START_1 200
#define PIN_START_2 201
#define PIN_A 215
#define PIN_B 210
#define PIN_X 213
#define PIN_Y 211
#define PIN_DHAT_LEFT 203
#define PIN_DHAT_RIGHT 205
#define PIN_DHAT_UP 206
#define PIN_DHAT_DOWN 202
#define PIN_DHAT_PUSH 204
#define PIN_R1 212
#define PIN_R2 214
#define PIN_R4 207
